#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mazurerm_resource_group.app_rg: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg][0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.logging_rg: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-logging-rg][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mazurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-logging-rg/providers/Microsoft.Insights/actionGroups/seclogic-dev-ag001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/serverFarms/seclogic-dev-asp001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-logging-rg/providers/Microsoft.Insights/components/seclogic-dev-appi001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mazapi_resource.subnet_logic_app: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/LogicAppSubnet][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mdata.azurerm_managed_api.managed_api_arm: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Web/locations/northeurope/managedApis/arm][0m
[0m[1mazapi_resource.api_connection_arm: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/connections/seclogic-dev-api-arm001][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mdata.azurerm_location.current: Read complete after 2s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/locations/northeurope][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/serverFarms/seclogic-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/serverFarms/seclogic-dev-asp001|applicationLogs-0][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-logging-rg/providers/Microsoft.Insights/components/seclogic-dev-appi001][0m
[0m[1mazapi_resource.storage_file_share: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001/fileServices/default/shares/logicapp][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001/providers/Microsoft.Authorization/roleAssignments/2041b266-f3ed-03cf-d7ee-e1d0f276be4c][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001|applicationLogs-0][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001/providers/Microsoft.Authorization/roleAssignments/b8ab8cff-d216-ce53-b14d-e8ff719c3aba][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001|applicationLogs-0][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_logic_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_logic_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azapi_resource.api_connection_arm[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "api_connection_arm" {
      [33m~[0m[0m body                      = jsonencode(
          [33m~[0m[0m {
              [33m~[0m[0m properties = {
                  [33m~[0m[0m api                   = {
                      [33m~[0m[0m iconUri     = "https://connectoricons-prod.azureedge.net/releases/v1.0.1685/1.0.1685.3700/arm/icon.png" [33m->[0m[0m "https://connectoricons-prod.azureedge.net/u/shgogna/globalperconnector-train1/1.0.1639.3310/arm/icon.png"
                        id          = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Web/locations/northeurope/managedApis/arm"
                        name        = "arm"
                        [90m# (4 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (3 unchanged attributes hidden)[0m[0m
                }
                [90m# (1 unchanged attribute hidden)[0m[0m
            }
        )
        id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/connections/seclogic-dev-api-arm001"
        name                      = "seclogic-dev-api-arm001"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # azapi_resource.api_connection_arm_access_policy[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "api_connection_arm_access_policy" {
      [32m+[0m[0m body                      = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m name                      = (known after apply)
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/connections/seclogic-dev-api-arm001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = false
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Web/connections/accessPolicies@2016-06-01"
    }

[1m  # azapi_resource.subnet_private_endpoints[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_private_endpoints" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.3.1.128/26"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "PeSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_sample[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_sample" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001"
      [32m+[0m[0m name                    = "MySampleSecret"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_logic_app_standard.logic_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_logic_app_standard" "logic_app" {
      [32m+[0m[0m app_service_plan_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Web/serverFarms/seclogic-dev-asp001"
      [32m+[0m[0m app_settings                   = (known after apply)
      [32m+[0m[0m bundle_version                 = "[1.*, 2.0.0)"
      [32m+[0m[0m client_affinity_enabled        = false
      [32m+[0m[0m client_certificate_mode        = "Required"
      [32m+[0m[0m custom_domain_verification_id  = (known after apply)
      [32m+[0m[0m default_hostname               = (known after apply)
      [32m+[0m[0m enabled                        = true
      [32m+[0m[0m https_only                     = true
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m kind                           = (known after apply)
      [32m+[0m[0m location                       = "northeurope"
      [32m+[0m[0m name                           = "seclogic-dev-la001"
      [32m+[0m[0m outbound_ip_addresses          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses = (known after apply)
      [32m+[0m[0m resource_group_name            = "seclogic-dev-app-rg"
      [32m+[0m[0m site_credential                = (known after apply)
      [32m+[0m[0m storage_account_access_key     = (sensitive value)
      [32m+[0m[0m storage_account_name           = "seclogicdevstg001"
      [32m+[0m[0m storage_account_share_name     = "logicapp"
      [32m+[0m[0m use_extension_bundle           = true
      [32m+[0m[0m version                        = "~4"
      [32m+[0m[0m virtual_network_subnet_id      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/LogicAppSubnet"

      [32m+[0m[0m connection_string (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                        = false
          [32m+[0m[0m app_scale_limit                  = 0
          [32m+[0m[0m auto_swap_slot_name              = (known after apply)
          [32m+[0m[0m dotnet_framework_version         = "v6.0"
          [32m+[0m[0m elastic_instance_minimum         = 1
          [32m+[0m[0m ftps_state                       = "Disabled"
          [32m+[0m[0m http2_enabled                    = true
          [32m+[0m[0m ip_restriction                   = []
          [32m+[0m[0m linux_fx_version                 = (known after apply)
          [32m+[0m[0m min_tls_version                  = "1.2"
          [32m+[0m[0m pre_warmed_instance_count        = 1
          [32m+[0m[0m public_network_access_enabled    = true
          [32m+[0m[0m runtime_scale_monitoring_enabled = true
          [32m+[0m[0m scm_ip_restriction               = []
          [32m+[0m[0m scm_min_tls_version              = "1.2"
          [32m+[0m[0m scm_type                         = "None"
          [32m+[0m[0m scm_use_main_ip_restriction      = false
          [32m+[0m[0m use_32_bit_worker_process        = false
          [32m+[0m[0m vnet_route_all_enabled           = true
          [32m+[0m[0m websockets_enabled               = false

          [32m+[0m[0m cors (known after apply)
        }
    }

[1m  # azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_activity_log_alert" "monitor_activity_log_alert_service_health" {
      [32m+[0m[0m description         = "Alerts about service health and maintenance events."
      [32m+[0m[0m enabled             = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "global"
      [32m+[0m[0m name                = "seclogic-dev-alert-servicehealth"
      [32m+[0m[0m resource_group_name = "seclogic-dev-logging-rg"
      [32m+[0m[0m scopes              = [
          [32m+[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0",
        ]

      [32m+[0m[0m action {
          [32m+[0m[0m action_group_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-logging-rg/providers/Microsoft.Insights/actionGroups/seclogic-dev-ag001"
          [32m+[0m[0m webhook_properties = {
              [32m+[0m[0m "alert-type"   = "service-health"
              [32m+[0m[0m "environment"  = "dev"
              [32m+[0m[0m "location"     = "northeurope"
              [32m+[0m[0m "severity"     = "Info"
              [32m+[0m[0m "subscription" = "1fdab118-1638-419a-8b12-06c9543714a0"
            }
        }

      [32m+[0m[0m criteria {
          [32m+[0m[0m category = "ServiceHealth"

          [32m+[0m[0m resource_health (known after apply)

          [32m+[0m[0m service_health {
              [32m+[0m[0m events    = [
                  [32m+[0m[0m "Incident",
                  [32m+[0m[0m "Maintenance",
                ]
              [32m+[0m[0m locations = [
                  [32m+[0m[0m "Global",
                  [32m+[0m[0m "North Europe",
                ]
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_logic_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_logic_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # azurerm_private_endpoint.logic_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "logic_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogic-dev-la001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogic-dev-la001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogic-dev-la001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogic-dev-la001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.logic_app_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "logic_app_role_assignment_storage" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogic-dev-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogic-dev-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogic-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogic-dev-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.KeyVault/vaults/seclogic-dev-kv001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.key_vault.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-blob-svc"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-file-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-file-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-file-svc"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "file",
            ]
        }
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-queue-svc"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "seclogicdevstg001-table-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "seclogicdevstg001-table-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "seclogic-dev-app-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "seclogicdevstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "seclogicdevstg001-table-svc"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/seclogic-dev-app-rg/providers/Microsoft.Storage/storageAccounts/seclogicdevstg001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "table",
            ]
        }
    }

[1m  # module.storage_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "120s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 16 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>